---
type: FaceSplitter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FaceSplitter

`Autodesk.Revit.DB.FaceSplitter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetBoundaries | 2020 | `public IList < CurveLoop > GetBoundaries ()` |
| Property | Parameter | — | `` |
| Property | SplitElementId | 2012 | `public ElementId SplitElementId { get ; }` |